app/controllers/admin_section_controller.rb

SELECT "problems".* FROM "problems"
---
  def browse
    @problems = Problem.all

INSERT INTO "problems" ("created_at", "question", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 19 Mar 2013 16:54:15 UTC +00:00], ["question", ""], ["title", ""], ["updated_at", Tue, 19 Mar 2013 16:54:15 UTC +00:00]]
---
  def create
  	@problem = Problem.new
  	@problem.title = params[:title]
  	@problem.question = params[:question]
  	@problem.save

SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 10]]
---
  def destroy
    @problem = Problem.find(params[:id])
    @problem.destroy