app/controllers/problem_controller.rb

SELECT "problems".* FROM "problems"
SELECT "solveds".* FROM "solveds" WHERE "solveds"."user_id" = 1 AND "solveds"."problem_id" = 12 LIMIT 1
SELECT "solveds".* FROM "solveds" WHERE (1)
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def browse
  	@problems = Problem.all
    if Solved.find_by_user_id(current_user.id)
      @solved_problems = Solved.where(user_id = current_user.id)

SELECT "problems".* FROM "problems" WHERE "problems"."id" IS NULL LIMIT 1
---
  def show
  	@problem = Problem.find_by_id(params[:id])

SELECT "solveds".* FROM "solveds" WHERE "solveds"."user_id" = 1 AND "solveds"."problem_id" = 12 LIMIT 1
INSERT INTO "solveds" ("created_at", "problem_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Mar 2013 20:52:14 UTC +00:00], ["problem_id", 12], ["updated_at", Thu, 21 Mar 2013 20:52:14 UTC +00:00], ["user_id", 1]]
---
  def answer
  	file = params[:upload].tempfile
    extension = File.extname(params[:upload].original_filename)
    @id = params[:id]
  	@content = File.read(file)
    filename = current_user.username+extension
  	file2 = File.new(filename,'w')
  	file2.write(@content)
  	file2.close
  	if extension == ".c"
      `gcc #{filename}`
      @output = `./a.out < 'input'#{@id}`
    elsif extension == ".cpp"
      `g++ #{filename}`
       @output = `./a.out < 'input'#{@id}`
    elsif extension == ".py"
      @output = `python #{filename} < 'input'#{@id}`.chop
    elsif extension == ".rb"
      @output = `ruby #{filename} < 'input'#{@id}`.chop
    end
  	if @output == File.read('output' + @id)
  		@result = 'Success'
      if !Solved.find_by_user_id_and_problem_id(current_user.id, params[:id])
        @solved = Solved.new
        @solved.problem_id = params[:id]
        @solved.user_id = current_user.id
        @solved.save